"""
Задание 7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2
Нужно написать рекурсивную ф-цию только для левой части выражения!
Результат нужно сверить с правой частью.
Правой части выражения в рекурсивной ф-ции быть не должно!
Решите через рекурсию. В задании нельзя применять циклы.
"""


def proof(n):
    if n == 0:
        return n
    return n + proof(n - 1)


number = 5
left_sum = proof(number)
right_sum = int(number * (number + 1) / 2)
print(f'{left_sum} == {right_sum} {left_sum == right_sum}')
